Диплом_ЖТГ/src/Documents/ВКМ_ВыплатаЗарплаты/ВКМ_ВыплатаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВыплатаЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_Выплаты</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ДополнительныеНачисления</types>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом_ЖТГ/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>ВКМ_Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_ВидРасчета</name>
    <type>
      <types>ChartOfCalculationTypesRef</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Диплом_ЖТГ/src/Documents/ВКМ_ВыплатаЗарплаты/Forms/ВКМ_ФормаДокумента/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВКМ_Заполнить(Команда)
	ВКМ_ЗаполнитьНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВКМ_ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_Сотрудник КАК Сотрудник,
	|	СУММА(ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_СуммаОстаток) КАК СуммаОстаток,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_ВидРасчета КАК ВидРасчета
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период,) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_Сотрудник,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_ВидРасчета";
	
	Период = Новый Граница(Объект.Дата, ВидГраницы.Включая);
	Запрос.УстановитьПараметр("Период", Период);
	Результат = Запрос.Выполнить().Выбрать();

	Объект.ВКМ_Выплаты.Очистить();

	Пока Результат.Следующий() Цикл

		Строка = Объект.ВКМ_Выплаты.Добавить();
		Строка.ВКМ_Сотрудник = Результат.Сотрудник;
		Строка.ВКМ_ВидРасчета = Результат.ВидРасчета;
		Строка.ВКМ_Сумма = Результат.СуммаОстаток;

	КонецЦикла;

КонецПроцедуры
#КонецОбласти
